from .session import Session
from .menu_graphic import select, login, setting
from .play import play
from .ranking import show_ranking
print("""
                                                                                                                            
        ██                                                                                                                  
        ██      ██████████████████████                        ██                            ████      ██          ████      
        ██      ████              ████                        ██                            ████      ████      ████        
        ██      ████              ████                        ██                              ████    ████      ████        
        ██      ██████████████████████                      ██████                            ██              ████          
    ██  ██  ████████              ████                      ██  ██                        ██████████████████████████████    
  ████  ██  ██  ██████████████████████                      ██  ██                        ████          ██          ████    
  ████  ██████        ██      ██                          ████  ████                      ████          ██          ████    
  ████  ████          ██      ██              ██████████████      ██████████████          ██████████████████████████████    
  ████  ██      ██████████████████████          ████                      ████            ████          ██          ████    
        ██            ██      ██                    ████              ██████              ████          ██          ████    
        ██    ██████████████████████████              ████          ████                  ██████████████████████████████    
        ██          ████        ██                      ██          ██                                  ██                  
      ████        ████    ██    ██████                ██              ██                                ██                  
      ██████  ██████████  ██  ████  ████              ██    ██████    ██                                ██                  
      ██████████          ██████                      ██  ████  ████  ██              ██████████████████████████████████████
      ██    ██      ████████████████                ██████          ██████                              ██                  
    ████    ██  ██████    ██    ██████              ████              ████                              ██                  
  ████          ██    ██████        ██              ██                  ██                              ██                  
                        ████                                                                            ██                  
                                                                                                                            
                                                        〜爆速単語帳〜                                                      
""")

def show_play_menu(session:Session):
	while True:
		match select("メニュー(qをおして終了)",[
			"プレイ",
			"ランキング",
			"設定",
			"ログアウト",
			"終了",
		], value_on_q=4):
			case 0:
				if not play(session):
					break
			case 1:
				if not show_ranking(session):
					break
			case 2:
				setting()
			case 3:
				break
			case 4:
				raise SystemExit()
while True:
	with login() as session:
		show_play_menu(session)